{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "main_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 84, 84, 3], "dtype": "float32", "sparse": false, "name": "main_input"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["main_input", 0, 0, {}]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["conv1", 0, 0, {}]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["conv2", 0, 0, {}]]}, {"name": "conv4", "class_name": "Conv2D", "config": {"name": "conv4", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["conv3", 0, 0, {}]]}, {"name": "value", "class_name": "Lambda", "config": {"name": "value", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAAATAAAAcyQAAAB8AGQAZACFAmQAZACFAmQAZACFAogAZAEaAGQAhQJm\nBBkAUwApAk7pAgAAAKkAKQHaBWxheWVyKQHaEGZpbmFsX2xheWVyX3NpemVyAgAAAPoePGlweXRo\nb24taW5wdXQtNS1hNzFlMTc4MDQwYWI+2gg8bGFtYmRhPi0AAABzAAAAAA==\n", null, [512]], "module": "__main__", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [["conv4", 0, 0, {}]]}, {"name": "advantage", "class_name": "Lambda", "config": {"name": "advantage", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAAATAAAAcyQAAAB8AGQAZACFAmQAZACFAmQAZACFAmQAiABkARoAhQJm\nBBkAUwApAk7pAgAAAKkAKQHaBWxheWVyKQHaEGZpbmFsX2xheWVyX3NpemVyAgAAAPoePGlweXRo\nb24taW5wdXQtNS1hNzFlMTc4MDQwYWI+2gg8bGFtYmRhPiwAAABzAAAAAA==\n", null, [512]], "module": "__main__", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [["conv4", 0, 0, {}]]}, {"name": "value_flatten", "class_name": "Flatten", "config": {"name": "value_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [["value", 0, 0, {}]]}, {"name": "advantage_flatten", "class_name": "Flatten", "config": {"name": "advantage_flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [["advantage", 0, 0, {}]]}, {"name": "value_final", "class_name": "Dense", "config": {"name": "value_final", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["value_flatten", 0, 0, {}]]}, {"name": "advantage_final", "class_name": "Dense", "config": {"name": "advantage_final", "trainable": true, "dtype": "float32", "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [["advantage_flatten", 0, 0, {}]]}, {"name": "final_out", "class_name": "Lambda", "config": {"name": "final_out", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAcyQAAAB8AGQBGQB8AGQCGQB0AGoBfABkAhkAZAJkA2QEjQMY\nABcAUwApBU7pAAAAAOkBAAAAVCkC2gRheGlz2ghrZWVwZGltcykC2gFL2gRtZWFuKQFaB3ZhbF9h\nZHapAHIHAAAA+h48aXB5dGhvbi1pbnB1dC01LWE3MWUxNzgwNDBhYj7aCDxsYW1iZGE+OwAAAHMA\nAAAA\n", null, null], "module": "__main__", "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "inbound_nodes": [[["value_final", 0, 0, {}], ["advantage_final", 0, 0, {}]]]}], "input_layers": ["main_input", 0, 0], "output_layers": ["final_out", 0, 0]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}